app/Http/Controllers/BenangController.php

SELECT * FROM `master_benang`
SELECT * FROM `bpb_benang`
---
    public function index(Request $request)
        {
            if ($request->ajax()) {
                $data = PenerimaanBenang::select('*')->with(['bsuppliers','bpbs']);
                return Datatables::of($data)
                        ->addIndexColumn()
                        ->addColumn('action', 'benang.actions')
                        ->orderBy('created_at', 'desc')
                        ->rawColumns(['action'])
                        ->make(true);
            }
            $suppliers = BenangSuppliers::all();
            $masterbenangs = Master_benang::all();

SELECT * FROM `master_benang`
SELECT * FROM `bpb_benang`
---
    public function create()
    {
        $suppliers = BenangSuppliers::all();
        $masterbenangs = Master_benang::all();