app/Http/Controllers/CustomerController.php

INSERT INTO `customer` (`nama_customer`, `keterangan`, `updated_at`, `created_at`) VALUES ('ryan hidayat', , '2023-01-26 07:14:26', '2023-01-26 07:14:26')
---
    public function store(Request $request)
    {
        request()->validate([
            'nama_customer' => 'required',
            'alamat',
            'no_tlp',
            'email',
            'PT',
            'keterangan',
        ]);

        Customer_kain::create($request->all());