app/Http/Controllers/GJPenerimaankainController.php

INSERT INTO `penerimaan_kain` (`kode_barang`, `tanggal`, `id_customer`, `jenis_kain`, `warna`, `KOP`, `LOT`, `ROL`, `KG`, `jenis_stock`, `keterangan`, `updated_at`, `created_at`) VALUES ('db53ba', '2023-01-24', '1', 'CVC', 'DUSTY PINK', '1', '5622', '121', '1882.11', 'stock_polos', '1', '2023-01-23 07:29:46', '2023-01-23 07:29:46')
---
    public function store(Request $request)
    {
        $request->validate([
            'tanggal_masuk' => 'required|date',
            'kode_kain' => 'required|exists:df_regkain_polos,kode_kain',
            'jenis' => 'required',
        ]);
        // $kode_kain = explode(',', $request->kode_kain);
        $regkain = DFregkain_polos::where('kode_kain', $request->kode_kain)->first();
        $kg = $regkain ? $regkain->KG : null;

        $penerimaanKain = new GJpenerimaan_kain ([
            'tanggal_masuk' => $request->tanggal_masuk,
            'kode_kain' => $request->kode_kain,
            'kg' => $kg,
        ]);

        $penerimaanKain->save();