app/Http/Controllers/MasterBenangController.php

    public function store(Request $request)
    {
        request()->validate([
            'id_supplier' => 'required',
            'jenis_benang' => 'required',
            'tipe_benang'=> 'required',
            'LOT' => 'required',
            'BOX_KRG' => 'required|numeric',
            'KG' => 'required|numeric',
            'BALE',
            'keterangan',
        ]);

        Master_benang::create($request->all());
---
INSERT INTO `master_benang` (`id_supplier`, `jenis_benang`, `tipe_benang`, `LOT`, `BOX_KRG`, `KG`, `BALE`, `keterangan`, `updated_at`, `created_at`) VALUES ('1', 'CD 20', 'COTTON', '7822', '62.1', '1882.11', '10.373181216931217', , '2023-01-25 08:59:45', '2023-01-25 08:59:45')