app/Http/Controllers/PengirimanKainController.php

INSERT INTO `pengiriman_kain` (`id_customer`, `SP_NO`, `jenis_kain`, `KOP`, `kode_barang`, `tanggal`, `NO_POL`, `TOTAL`, `NO_PO`, `keterangan`, `updated_at`, `created_at`) VALUES ('1', '21', 'stock_polos', '1', '43874b', '2023-01-30', '1231313', '12', '123', , '2023-01-30 03:41:21', '2023-01-30 03:41:21')
---
    public function store(Request $request)
    {
        request()->validate([
        'id_customer' => 'required',
        'SP_NO' => 'required',
        'jenis_kain' => 'required',
        'kop' => 'required',
        'kode_barang' => 'required',
        'NO_PO' => 'required',
        'TOTAL' => 'required',
        'tanggal' => 'required',
        'NO_POL' => 'required',
        'keterangan'
        ]);

        pengiriman_kain::create($request->all());