app/Http/Controllers/UserController.php

SELECT * FROM `users` ORDER BY `id` DESC LIMIT 5 offset 0
SELECT count(*) as aggregate FROM `users`
---
    public function index(Request $request)
    {
        $data = User::orderBy('id','DESC')->paginate(5);